## Importing Libraries

In [1]:
# Libraries

import pandas as pd
import numpy as np

## Creating DataFrame

In [7]:
# Created dataframe monitors salesperson, their sales rep status in the company, and their earnings sold for the year.

df=pd.DataFrame({"Salesperson":["Alice","Bob","Charlie","Diana","Eve"],"Rep Status":["Senior","Senior","Junior","Mid-Level","Junior"],"Sales":[1200000,700000,350000,850000,450000]})

In [8]:
df.head()

  Salesperson Rep Status    Sales
0       Alice     Senior  1200000
1         Bob     Senior   700000
2     Charlie     Junior   350000
3       Diana  Mid-Level   850000
4         Eve     Junior   450000

## Creating New Column Using Mathematical Procedure with Lambda Function

In [11]:
# Creating column showing percentage of overall sales salesperson held

sales_percentage=lambda x:round(x/3550000*100,2)

# putting assigned variable to use in lambda

sales_percentage(df['Sales'])

0    33.80
1    19.72
2     9.86
3    23.94
4    12.68
Name: Sales, dtype: float64

In [13]:
# Creating New Column Based on Sales Percentage Found in above Lambda Function

df["Rep_Percentage_of_Total_Sales"]=sales_percentage(df["Sales"])

In [14]:
df.head()

  Salesperson Rep Status    Sales  Rep_Percentage_of_Total_Sales
0       Alice     Senior  1200000                          33.80
1         Bob     Senior   700000                          19.72
2     Charlie     Junior   350000                           9.86
3       Diana  Mid-Level   850000                          23.94
4         Eve     Junior   450000                          12.68

## Creating Flag Column

In [15]:
# Creating Flag Column of Earner Ranking based on sales

df['Earning_Rank']=df['Sales'].apply(lambda x:'High Earner' if x>1000000 else ('Low Earner' if x<=500000 else 'Average Earner'))

df

,Salesperson,Rep Status,Sales,Rep_Percentage_of_Total_Sales,Earning_Rank
0,Alice,Senior,1200000,33.80,High Earner
1,Bob,Senior,700000,19.72,Average Earner
2,Charlie,Junior,350000,9.86,Low Earner
3,Diana,Mid-Level,850000,23.94,Average Earner
4,Eve,Junior,450000,12.68,Low Earner

In [18]:
# Creating flag with Earner Rank column to show which who gets bonus and who does not.

df["Bonus_Eligibility" ]=df["Earning_Rank"].apply(lambda x: "Bonus" if x=="High Earner" else "No Bonus")

In [19]:
df.head()

,Salesperson,Rep Status,Sales,Rep_Percentage_of_Total_Sales,Earning_Rank,Bonus_Eligibility
0,Alice,Senior,1200000,33.80,High Earner,Bonus
1,Bob,Senior,700000,19.72,Average Earner,No Bonus
2,Charlie,Junior,350000,9.86,Low Earner,No Bonus
3,Diana,Mid-Level,850000,23.94,Average Earner,No Bonus
4,Eve,Junior,450000,12.68,Low Earner,No Bonus